Autodesk.Revit.DB.FabricationService.GetButton(System.Int32,System.Int32)
Gets the service button for a given group index and button index from the service.
groupIndex:
The group index.
buttonIndex:
The button index.
Returns:
The service button
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index groupIndex is not larger or equal to 0 and less than GroupCount
Since:
2016

Autodesk.Revit.DB.FabricationService.IsValidButtonIndex(System.Int32,System.Int32)
Validates the button index.
groupIndex:
The group index.
buttonIndex:
The button index to check.
Returns:
True if larger or equal to 0 and less than GroupCount.
Since:
2016

Autodesk.Revit.DB.FabricationService.GetButtonCount(System.Int32)
Gets the number of buttons for a given group in the service.
group:
The index of the group
Returns:
The number of buttons.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index group is not larger or equal to 0 and less than GroupCount
Since:
2016

Autodesk.Revit.DB.FabricationService.OverrideServiceButtonExclusion(System.Int32,System.Int32,System.Boolean)
Overrides the default service button exclusions, used by Route and Fill, Design to Fabrication, or Multi Point Routing for the current user and session only.
groupIndex:
The index of the service group to exclude the service button from.
buttonIndex:
The index of the service button to exclude.
exclude:
Pass true to exclude from being used by Route and Fill or Design to Fabrication.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index groupIndex is not larger or equal to 0 and less than GroupCount
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationService.ResetServiceExclusionOverrides
Resets the overridden service group and button exclusions back to default, as defined by the configuration.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationService.SetServiceGroupExclusions(System.Collections.Generic.IList{System.Int32})
Sets the service group exclusions, used by Route and Fill or Design to Fabrication commands, for the current user and session only. This will alter them from the default configuration exclusions to only exclude those groups passed.
excludedGroups:
A list of service group indexes to be excluded.
Returns:
Returns true if succeeded to set the exclusions to the specified group(s).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
groupIndices contains an index that is not larger or equal to 0 and less than GroupCount
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationService.IsGroupExcluded(System.Int32)
Get whether a service group is excluded from being used by the Route and Fill, Design to Fabrication, or Multi Point Routing commands. The default configuration values may be overridden by SetServiceGroupExclusions.
groupIndex:
The index of the group.
Returns:
Returns true if the group indexed by groupIndex is currently to be excluded.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index groupIndex is not larger or equal to 0 and less than GroupCount
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationService.IsCompatibleWith(Autodesk.Revit.DB.FabricationService)
Check whether the service is broadly interchangable with another one without affecting part geometry. The services must have the same fabrication system template and specification.
Returns:
Returns true if the services are compatible.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationService.GetGroupName(System.Int32)
Gets the name of a group based on group index.
group:
The index of the group.
Returns:
The name of the group.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index group is not larger or equal to 0 and less than GroupCount
Since:
2016

Autodesk.Revit.DB.FabricationService.IsValidGroupIndex(System.Int32)
Validates the group index.
groupIndex:
The group index to check.
Returns:
True if larger or equal to 0 and less than GroupCount.
Since:
2016

Autodesk.Revit.DB.FabricationService.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationService.ServiceId
The service identifier of the service.
Since:
2016

Autodesk.Revit.DB.FabricationService.GroupCount
The number of groups in the service.
Since:
2016

Autodesk.Revit.DB.FabricationService.FabricationSystemName
The fabrication system name of the service.
Remarks:
A fabrication system in this context is a set of buttons that can be shared across fabrication services.
It has nothing to do with other MEP systems in Revit.
Since:
2016

Autodesk.Revit.DB.FabricationService.Abbreviation
The short name of service.
Since:
2016

Autodesk.Revit.DB.FabricationService.Name
The name of the service.
Since:
2016

Autodesk.Revit.DB.FabricationService
This object contains information about a fabrication service.
Remarks:
A fabrication service defines what fabrication service buttons that can be used. Fabrication services are part of the fabrication configuration.
Since:
2016